In [1]:
!mkdir -p out_meds
!mkdir -p out_labs
!mkdir -p out_vitals
!mkdir -p out_flow

In [2]:
!python FIDDLE-transform-labs.py

Input data file: ./data_input/labs.p

Input arguments:
    T      = 240
    dt     = 240.0
    θ₁     = 0.001
    θ₂     = 0.001
    θ_freq = 1.0
    k      = 3 ['min', 'max', 'mean']
binarize = yes

N = 459902
L = 1

Done unstacking
Done reindexing
Time elapsed: 265.299769 seconds

In [3]:
!python FIDDLE-transform-meds.py

Input data file: ./data_input/meds.p

Input arguments:
    T      = 240
    dt     = 240.0
    θ₁     = 0.001
    θ₂     = 0.001
    θ_freq = 1.0
    k      = 3 ['min', 'max', 'mean']
binarize = yes

N = 459902
L = 1

Done unstacking
Done reindexing
Time elapsed: 701.482105 seconds

In [4]:
!python FIDDLE-transform-flow-20.py

Input data file: ./data_input/flow-20.p

Input arguments:
    T      = 240
    dt     = 240.0
    θ₁     = 0.001
    θ₂     = 0.001
    θ_freq = 1.0
    k      = 3 ['min', 'max', 'mean']
binarize = yes

N = 459902
L = 1

Done unstacking
Done reindexing
Time elapsed: 103.720938 seconds
Done! Time elapsed: 120.053329 seconds

In [5]:
!python FIDDLE-transform-vitals.py

Input data file: ./data_input/vitals.p

Input arguments:
    T      = 240
    dt     = 240.0
    θ₁     = 0.001
    θ₂     = 0.001
    θ_freq = 1.0
    k      = 3 ['min', 'max', 'mean']
binarize = yes

N = 459902
L = 1


--------------------------------------------------------------------------------
2-B) Transform time-dependent data
--------------------------------------------------------------------------------
Total variables    : 6
Frequent variables : ['respiratoryrate', 'heartrate', 'temperature', 'sbp', 'dbp', 'spo2']
M₁ = 6
M₂ = 0
k  = 3 ['min', 'max', 'mean']

Transforming each example...
Batches of size 1000:  425
100%|█████████████████████████████████████████| 425/425 [30:42<00:00,  4.33s/it]

Parallel processing done
Filled no-data examples done

(N × L × ^D) table :	 (424741, 1, 30)
Time elapsed: 3096.015814 seconds

python FIDDLE-transform-meds.py > >(tee "out_meds/out.txt") 2> >(tee "out_meds/err.txt" >&2)

python FIDDLE-transform-labs.py > >(tee "out_labs/out.txt") 2> >(tee "out_labs/err.txt" >&2)

python FIDDLE-transform-flow.py > >(tee "out_flow/out.txt") 2> >(tee "out_flow/err.txt" >&2)

python FIDDLE-transform-vitals.py > >(tee "out_vitals/out.txt") 2> >(tee "out_vitals/err.txt" >&2)

In [1]:
import pandas as pd

In [2]:
df_vars = pd.read_csv('out_flow/value_types.csv')

In [3]:
df_vars

     variable_name   value_type
0          _307788      Numeric
1          _307791      Numeric
2          _307792      Numeric
3          _307793  Categorical
4          _307795      Numeric
...            ...          ...
1374       _685244      Numeric
1375       _685863      Numeric
1376       _686396  Categorical
1377       _686397  Categorical
1378       _690305      Numeric

[1379 rows x 2 columns]

In [4]:
variables_num_freq = [
    '_307788', '_307791', '_307792', '_307834', '_307836', '_307927',
    '_308199', '_327706', '_335304', '_654071', '_654072', '_654073',
    '_654075', '_685863'
]

In [6]:
df_vars_1 = df_vars[df_vars['variable_name'].isin(variables_num_freq)]

In [7]:
df_vars_1

     variable_name value_type
0          _307788    Numeric
1          _307791    Numeric
2          _307792    Numeric
19         _307834    Numeric
20         _307836    Numeric
31         _307927    Numeric
112        _308199    Numeric
799        _327706    Numeric
846        _335304    Numeric
1356       _654071    Numeric
1357       _654072    Numeric
1358       _654073    Numeric
1360       _654075    Numeric
1375       _685863    Numeric

In [8]:
df_vars_1.to_csv('out_flow-1/value_types.csv', index=False)

In [9]:
df_vars_2 = df_vars[~df_vars['variable_name'].isin(variables_num_freq)]

In [10]:
df_vars_2

     variable_name   value_type
3          _307793  Categorical
4          _307795      Numeric
5          _307796      Numeric
6          _307799      Numeric
7          _307800      Numeric
...            ...          ...
1373       _676547      Numeric
1374       _685244      Numeric
1376       _686396  Categorical
1377       _686397  Categorical
1378       _690305      Numeric

[1365 rows x 2 columns]

In [11]:
df_vars_2.to_csv('out_flow-2/value_types.csv', index=False)